Repository: joey-barbier/MainOrNot
Catalog: Concurrency/Common/Localization/Localizable.xcstrings
Source language: fr
Languages: de, en, es, ja, pt_br

# 1. Basics
source: 1. Bases
de: 1. Grundlagen
en: 1. Basics
es: 1. Conceptos básicos
ja: 1. 基本
pt_br: 1. Básicos

# 2. Tasks
source: 2. Tâches
de: 2. Aufgaben
en: 2. Tasks
es: 2. Tareas
ja: 2. タスク
pt_br: 2. Tarefas

# 3. Actors
source: 3. Acteurs
de: 3. Akteure
en: 3. Actors
es: 3. Actores
ja: 3. アクター
pt_br: 3. Atores

# action.copy
source: Copier
de: Kopieren
en: Copy
es: Copiar
ja: コピー
pt_br: Copiar

# action.execute
source: Exécuter
de: Ausführen
en: Execute
es: Ejecutar
ja: 実行
pt_br: Executar

# action.executing
source: Exécution...
de: Wird ausgeführt...
en: Executing...
es: Ejecutando...
ja: 実行中...
pt_br: Executando...

# asynclet.objective
source: Objectif d'async let
de: async let Ziel
en: async let objective
es: Objetivo de async let
ja: async let の目的
pt_br: Objetivo de async let

# asynclet.validation
source: Validation d'async let
de: async let Validierung
en: async let validation
es: Validación de async let
ja: async let の検証
pt_br: Validação de async let

# cancellation.objective
source: Objectif d'annulation
de: Abbruch Ziel
en: Cancellation objective
es: Objetivo de cancelación
ja: キャンセルの目的
pt_br: Objetivo de cancelamento

# cancellation.validation
source: Validation d'annulation
de: Abbruch Validierung
en: Cancellation validation
es: Validación de cancelación
ja: キャンセルの検証
pt_br: Validação de cancelamento

# concurrent.objective
source: Objectif de concurrence
de: Nebenläufigkeit Ziel
en: Concurrent objective
es: Objetivo de concurrencia
ja: 並行処理の目的
pt_br: Objetivo de concorrência

# concurrent.validation
source: Validation de concurrence
de: Nebenläufigkeit Validierung
en: Concurrent validation
es: Validación de concurrencia
ja: 並行処理の検証
pt_br: Validação de concorrência

# datarace.objective
source: Objectif de course de données
de: Datenwettlauf Ziel
en: Data race objective
es: Objetivo de carrera de datos
ja: データ競合の目的
pt_br: Objetivo de corrida de dados

# datarace.validation
source: Validation de course de données
de: Datenwettlauf Validierung
en: Data race validation
es: Validación de carrera de datos
ja: データ競合の検証
pt_br: Validação de corrida de dados

# deinit.objective
source: Objectif de deinit
de: Deinit Ziel
en: Deinit objective
es: Objetivo de deinit
ja: deinitの目的
pt_br: Objetivo de deinit

# deinit.validation
source: Validation de deinit
de: Deinit Validierung
en: Deinit validation
es: Validación de deinit
ja: deinitの検証
pt_br: Validação de deinit

# example.asynclet.objective
source: Montrer que async let lance plusieurs opérations structurées en parallèle. Le temps total correspond au plus long téléchargement, pas à la somme.
de: Zeigen, dass async let mehrere strukturierte Operationen parallel startet. Gesamtzeit entspricht dem längsten Download, nicht der Summe.
en: Show that async let launches multiple structured operations in parallel. Total time corresponds to the longest download, not the sum.
es: Mostrar que async let lanza múltiples operaciones estructuradas en paralelo. El tiempo total corresponde a la descarga más larga, no a la suma.
ja: async letが複数の構造化された操作を並列で開始することを示す。 合計時間は最長のダウンロードに対応し、合計ではない。
pt_br: Mostrar que async let lança múltiplas operações estruturadas em paralelo. O tempo total corresponde ao download mais longo, não à soma.

# example.asynclet.title
source: async let : parallélisme simple
de: async let: Einfache Parallelität
en: async let: Simple Parallelism
es: async let: Paralelismo Simple
ja: async let: シンプルな並列処理
pt_br: async let: Paralelismo Simples

# example.cancellation.objective
source: Montrer que l'annulation des tâches est coopérative : la tâche doit vérifier Task.isCancelled ou appeler Task.checkCancellation().
de: Zeigen, dass die Aufgabenabbruch kooperativ ist: die Aufgabe muss Task.isCancelled prüfen oder Task.checkCancellation() aufrufen.
en: Show that task cancellation is cooperative: the task must check Task.isCancelled or call Task.checkCancellation().
es: Mostrar que la cancelación de tareas es cooperativa: la tarea debe verificar Task.isCancelled o llamar Task.checkCancellation().
ja: タスクキャンセルが協調的であることを示す：タスクは Task.isCancelledをチェックするかTask.checkCancellation()を呼び出す必要がある。
pt_br: Mostrar que o cancelamento de tarefas é cooperativo: a tarefa deve verificar Task.isCancelled ou chamar Task.checkCancellation().

# example.cancellation.title
source: Annulation coopérative
de: Kooperative Kündigung
en: Cooperative Cancellation
es: Cancelación Cooperativa
ja: 協調的キャンセル
pt_br: Cancelamento Cooperativo

# example.concurrent.objective
source: Montrer que @concurrent force une fonction à s'exécuter en arrière-plan, permetant de décharger le MainActor pour les calculs intensifs.
de: Zeigen, dass @concurrent eine Funktion zur Ausführung im Hintergrund zwingt, was es ermöglicht, den MainActor für intensive Berechnungen zu entlasten.
en: Show that @concurrent forces a function to execute in the background, allowing to offload the MainActor for intensive calculations.
es: Mostrar que @concurrent fuerza a una función a ejecutarse en segundo plano, permitiendo descargar el MainActor para cálculos intensivos.
ja: @concurrentが関数をバックグラウンドで実行することを強制し、 集約的な計算でMainActorの負荷を軽減できることを示す。
pt_br: Mostrar que @concurrent força uma função a executar em segundo plano, permitindo descarregar o MainActor para cálculos intensivos.

# example.concurrent.title
source: @concurrent : sortir du MainActor
de: @concurrent: MainActor verlassen
en: @concurrent: Escape MainActor
es: @concurrent: Escapar MainActor
ja: @concurrent: MainActor から脱出
pt_br: @concurrent: Escapar MainActor

# example.datarace.objective
source: Comparer un accès concurrent non protégé (résultat aléatoire) avec un actor qui sérialise les accès (résultat toujours correct).
de: Vergleiche ungeschützten gleichzeitigen Zugriff (zufälliges Ergebnis) mit einem Actor, der den Zugriff serialisiert (immer korrektes Ergebnis).
en: Compare unprotected concurrent access (random result) with an actor that serializes access (always correct result).
es: Comparar acceso concurrente no protegido (resultado aleatorio) con un actor que serializa el acceso (resultado siempre correcto).
ja: 保護されていない並行アクセス（ランダムな結果）と アクセスをシリアル化するactor（常に正しい結果）を比較する。
pt_br: Comparar acesso concorrente desprotegido (resultado aleatório) com um actor que serializa o acesso (resultado sempre correto).

# example.datarace.title
source: Actor : éliminer une data-race
de: Actor: Data Race eliminieren
en: Actor: Eliminate Data Race
es: Actor: Eliminar Data Race
ja: Actor: データ競合の排除
pt_br: Actor: Eliminar Data Race

# example.deinit.objective
source: Montrer qu'isolated deinit permet de nettoyer les ressources d'un actor de manière thread-safe, sans avertissement de data race.
de: Zeigen, dass isolated deinit die Bereinigung der Ressourcen eines Actors auf thread-sichere Weise ohne Data-Race-Warnungen ermöglicht.
en: Show that isolated deinit allows cleaning up an actor's resources in a thread-safe manner, without data race warnings.
es: Mostrar que isolated deinit permite limpiar los recursos de un actor de manera thread-safe, sin advertencias de data race.
ja: isolated deinitがactorのリソースをデータ競合警告なしで スレッドセーフな方法でクリーンアップできることを示す。
pt_br: Mostrar que isolated deinit permite limpar os recursos de um actor de maneira thread-safe, sem avisos de data race.

# example.deinit.title
source: isolated deinit : cleanup sûr
de: isolated deinit: Sichere Bereinigung
en: isolated deinit: Safe Cleanup
es: isolated deinit: Limpieza Segura
ja: isolated deinit: 安全なクリーンアップ
pt_br: isolated deinit: Limpeza Segura

# example.lifecycle.objective
source: Montrer le problème des Tasks qui continuent après navigation back et les solutions selon l'architecture (Vue directe vs ViewModel).
de: Das Problem von Tasks zeigen, die nach Navigation zurück fortfahren und Lösungen basierend auf der Architektur (Direkte Ansicht vs ViewModel).
en: Show the problem of Tasks that continue after navigation back and solutions based on architecture (Direct View vs ViewModel).
es: Mostrar el problema de las Tasks que continúan después de la navegación hacia atrás y las soluciones según la arquitectura (Vista directa vs ViewModel).
ja: ナビゲーションバック後もTaskが継続する問題と アーキテクチャに基づく解決策（直接ビュー vs ViewModel）を示す。
pt_br: Mostrar o problema das Tasks que continuam após navegação de volta e soluções baseadas na arquitetura (Vista direta vs ViewModel).

# example.lifecycle.title
source: Task Lifecycle & Navigation
de: Task-Lebenszyklus & Navigation
es: Ciclo de Vida de Task y Navegación
ja: Taskライフサイクルとナビゲーション
pt_br: Ciclo de Vida de Task e Navegação

# example.mainactor.objective
source: Démontrer les deux chemins d'exécution selon les flags : • fetch appelé depuis SwiftUI → reste sur MainActor • parse appelé via Task.detached → comportement selon AC/DAI
de: Demonstriere zwei Ausführungspfade gemäß Flags: • fetch von SwiftUI aufgerufen → bleibt auf MainActor • parse über Task.detached aufgerufen → Verhalten gemäß AC/DAI
en: Demonstrate two execution paths according to flags: • fetch called from SwiftUI → stays on MainActor • parse called via Task.detached → behavior according to AC/DAI
es: Demostrar dos rutas de ejecución según las flags: • fetch llamado desde SwiftUI → permanece en MainActor • parse llamado vía Task.detached → comportamiento según AC/DAI
ja: フラグによる2つの実行パスを実証: • SwiftUIから呼ばれるfetch → MainActorに留まる • Task.detached経由で呼ばれるparse → AC/DAIによる動作
pt_br: Demonstrar dois caminhos de execução de acordo com as flags: • fetch chamado do SwiftUI → permanece no MainActor • parse chamado via Task.detached → comportamento de acordo com AC/DAI

# example.mainactor.title
source: Impact des flags Swift 6
de: Swift 6 Flags Auswirkung
en: Swift 6 Flags Impact
es: Impacto de Flags Swift 6
ja: Swift 6 フラグの影響
pt_br: Impacto das Flags Swift 6

# example.nonisolated.objective
source: Montrer qu'une propriété nonisolated d'un actor permet un accès synchrone sans await. ⚠️ À ne pas confondre avec @concurrent : • nonisolated = supprime l'isolation complètement • @concurrent = garde l'isolation mais force background
de: Zeigen, dass eine nonisolated-Eigenschaft eines Actors synchronen Zugriff ohne await ermöglicht. ⚠️ Nicht zu verwechseln mit @concurrent: • nonisolated = entfernt Isolation vollständig • @concurrent = behält Isolation bei, erzwingt aber Hintergrund
en: Show that a nonisolated property of an actor allows synchronous access without await. ⚠️ Not to be confused with @concurrent: • nonisolated = removes isolation completely • @concurrent = keeps isolation but forces background
es: Mostrar que una propiedad nonisolated de un actor permite acceso síncrono sin await. ⚠️ No confundir con @concurrent: • nonisolated = elimina el aislamiento completamente • @concurrent = mantiene el aislamiento pero fuerza background
ja: actorのnonisolatedプロパティがawaitなしで同期アクセスを可能にすることを示す。⚠️ @concurrentと混同しないこと： • nonisolated = 分離を完全に削除 • @concurrent = 分離を保持するがバックグラウンドを強制
pt_br: Mostrar que uma propriedade nonisolated de um actor permite acesso síncrono sem await. ⚠️ Não confundir com @concurrent: • nonisolated = remove o isolamento completamente • @concurrent = mantém o isolamento mas força background

# example.nonisolated.title
source: Propriété nonisolated (lecture synchrone)
de: nonisolated Property (Sync Zugriff)
en: nonisolated Property (Sync Access)
es: Propiedad nonisolated (Acceso Sync)
ja: nonisolated プロパティ（同期アクセス）
pt_br: Propriedade nonisolated (Acesso Sync)

# example.taskgroup.objective
source: Montrer TaskGroup pour l'exécution parallèle avec inférence automatique du type de retour (plus besoin d'expliciter le type). Comparer avec async let pour des cas d'usage différents.
de: Zeige TaskGroup für parallele Ausführung mit automatischer Rückgabetyp-Inferenz (keine explizite Typangabe nötig). Vergleiche mit async let für verschiedene Anwendungsfälle.
en: Show TaskGroup for parallel execution with automatic return type inference (no need to specify type explicitly). Compare with async let for different use cases.
es: Mostrar TaskGroup para ejecución paralela con inferencia automática del tipo de retorno (no es necesario especificar el tipo explícitamente). Comparar con async let para diferentes casos de uso.
ja: 戻り値型の自動推論による並列実行のためのTaskGroupを示す（型を明示的に指定する必要なし）。 異なる使用例でasync letと比較する。
pt_br: Mostrar TaskGroup para execução paralela com inferência automática do tipo de retorno (não é necessário especificar o tipo explicitamente). Comparar com async let para diferentes casos de uso.

# example.taskgroup.title
source: TaskGroup : parallélisme structuré
de: TaskGroup: Strukturierte Parallelität
en: TaskGroup: Structured Parallelism
es: TaskGroup: Paralelismo Estructurado
ja: TaskGroup: 構造化並列処理
pt_br: TaskGroup: Paralelismo Estruturado

# example.taskvs.objective
source: Montrer la différence entre Task {} qui hérite du contexte et Task.detached {} qui part théoriquement d'un contexte neutre. ⚠️ Attention Swift 6.2 : même Task.detached peut revenir sur MainThread si on appelle des fonctions @MainActor (struct sans annotation = @MainActor).
de: Zeige den Unterschied zwischen Task {}, das den Kontext erbt, und Task.detached {}, das theoretisch von einem neutralen Kontext startet. ⚠️ Warnung Swift 6.2: selbst Task.detached kann zum MainThread zurückkehren, wenn @MainActor-Funktionen aufgerufen werden (struct ohne Annotation = @MainActor).
en: Show the difference between Task {} which inherits the context and Task.detached {} which theoretically starts from a neutral context. ⚠️ Warning Swift 6.2: even Task.detached can return to MainThread if calling @MainActor functions (struct without annotation = @MainActor).
es: Mostrar la diferencia entre Task {} que hereda el contexto y Task.detached {} que teóricamente parte de un contexto neutral. ⚠️ Advertencia Swift 6.2: incluso Task.detached puede volver al MainThread si se llaman funciones @MainActor (struct sin anotación = @MainActor).
ja: コンテキストを継承するTask{}と理論的にニュートラルなコンテキストから始まるTask.detached{}の違いを示す。 ⚠️ Swift 6.2注意：Task.detachedでも@MainActor関数を呼び出すとMainThreadに戻る可能性がある（アノテーションなしのstruct = @MainActor）。
pt_br: Mostrar a diferença entre Task {} que herda o contexto e Task.detached {} que teoricamente parte de um contexto neutro. ⚠️ Aviso Swift 6.2: até mesmo Task.detached pode retornar ao MainThread se chamar funções @MainActor (struct sem anotação = @MainActor).

# Execute
source: Exécuter
de: Ausführen
en: Execute
es: Ejecutar
ja: 実行
pt_br: Executar

# cancellation.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Pas d'impact sur l'annulation • DAI (Default Actor Isolation) : Pas d'impact sur l'annulation L'annulation coopérative fonctionne de manière identique dans toutes les combinaisons. Task.isCancelled et Task.checkCancellation() sont indépendants des flags.
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Keine Auswirkung auf Abbruch • DAI (Default Actor Isolation) : Keine Auswirkung auf Abbruch Kooperativer Abbruch funktioniert identisch in allen Kombinationen. Task.isCancelled und Task.checkCancellation() sind unabhängig von Flags.
en: Swift 6 flags impact : • AC (Approachable Concurrency) : No impact on cancellation • DAI (Default Actor Isolation) : No impact on cancellation Cooperative cancellation works identically in all combinations. Task.isCancelled and Task.checkCancellation() are independent of flags.
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Sin impacto en cancelación • DAI (Default Actor Isolation) : Sin impacto en cancelación La cancelación cooperativa funciona idénticamente en todas las combinaciones. Task.isCancelled y Task.checkCancellation() son independientes de las flags.
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : キャンセレーションに影響なし • DAI (Default Actor Isolation) : キャンセレーションに影響なし 協調的キャンセレーションはすべての組み合わせで同様に動作します。 Task.isCancelledとTask.checkCancellation()はフラグに依存しません。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Sem impacto no cancelamento • DAI (Default Actor Isolation) : Sem impacto no cancelamento Cancelamento cooperativo funciona identicamente em todas as combinações. Task.isCancelled e Task.checkCancellation() são independentes das flags.

# concurrent.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore les diagnostics d'isolation pour @concurrent • DAI (Default Actor Isolation) : - nonisolated → @concurrent force l'arrière-plan - MainActor → @concurrent devient crucial pour l'opt-out 💪 @concurrent FORCE TOUJOURS l'exécution en arrière-plan. Avec DAI=MainActor, c'est essentiel pour éviter de bloquer l'UI.
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Isolationsdiagnose für @concurrent • DAI (Default Actor Isolation) : - nonisolated → @concurrent erzwingt Hintergrund - MainActor → @concurrent wird entscheidend für Opt-out 💪 @concurrent ERZWINGT IMMER Hintergrundausführung. Mit DAI=MainActor ist es essentiell, UI-Blockierung zu vermeiden.
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves isolation diagnostics for @concurrent • DAI (Default Actor Isolation) : - nonisolated → @concurrent forces background - MainActor → @concurrent becomes crucial for opt-out 💪 @concurrent ALWAYS forces background execution. With DAI=MainActor, it's essential to avoid blocking the UI.
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora los diagnósticos de aislamiento para @concurrent • DAI (Default Actor Isolation) : - nonisolated → @concurrent fuerza segundo plano - MainActor → @concurrent se vuelve crucial para opt-out 💪 @concurrent SIEMPRE fuerza ejecución en segundo plano. Con DAI=MainActor, es esencial para evitar bloquear la UI.
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : @concurrentの分離診断を改善 • DAI (Default Actor Isolation) : - nonisolated → @concurrentはバックグラウンドを強制 - MainActor → @concurrentはopt-outに重要 💪 @concurrentは常にバックグラウンド実行を強制します。 DAI=MainActorでは、UIブロックを避けるために不可欠です。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora diagnósticos de isolamento para @concurrent • DAI (Default Actor Isolation) : - nonisolated → @concurrent força segundo plano - MainActor → @concurrent torna-se crucial para opt-out 💪 @concurrent SEMPRE força execução em segundo plano. Com DAI=MainActor, é essencial para evitar bloquear a UI.

# datarace.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore les avertissements sur l'accès concurrent non protégé • DAI (Default Actor Isolation) : - nonisolated → Variables globales vulnérables aux data races - MainActor → Isolation par défaut, réduit les risques 🔒 Les Actors ÉLIMINENT TOUJOURS les data races, peu importe les flags. Les flags n'affectent que l'accès non-actor.
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Warnungen bei ungeschütztem nebenläufigem Zugriff • DAI (Default Actor Isolation) : - nonisolated → Globale Variablen anfällig für Data Races - MainActor → Standard-Isolation, reduziert Risiken 🔒 Actors ELIMINIEREN IMMER Data Races, unabhängig von Flags. Flags beeinflussen nur Nicht-Actor-Zugriff.
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves warnings on unprotected concurrent access • DAI (Default Actor Isolation) : - nonisolated → Global variables vulnerable to data races - MainActor → Default isolation, reduces risks 🔒 Actors ALWAYS eliminate data races, regardless of flags. Flags only affect non-actor access.
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora advertencias sobre acceso concurrente desprotegido • DAI (Default Actor Isolation) : - nonisolated → Variables globales vulnerables a data races - MainActor → Aislamiento por defecto, reduce riesgos 🔒 Los Actors SIEMPRE eliminan data races, sin importar las flags. Las flags solo afectan acceso no-actor.
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : 保護されていない並行アクセスの警告を改善 • DAI (Default Actor Isolation) : - nonisolated → グローバル変数がデータ競合に脆弱 - MainActor → デフォルト分離、リスクを軽減 🔒 Actorはフラグに関係なく、常にデータ競合を排除します。 フラグは非Actorアクセスのみに影響します。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora avisos sobre acesso concorrente desprotegido • DAI (Default Actor Isolation) : - nonisolated → Variáveis globais vulneráveis a data races - MainActor → Isolamento padrão, reduz riscos 🔒 Actors SEMPRE eliminam data races, independente das flags. Flags afetam apenas acesso não-actor.

# deinit.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore la détection d'accès non sécurisé dans deinit • DAI (Default Actor Isolation) : - nonisolated → isolated deinit optionnel - MainActor → isolated deinit presque obligatoire 🔒 isolated deinit garantit un nettoyage thread-safe. Avec DAI=MainActor, devient essentiel pour éviter les data races.
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Erkennung unsicherer Zugriffe in deinit • DAI (Default Actor Isolation) : - nonisolated → isolated deinit optional - MainActor → isolated deinit fast zwingend 🔒 isolated deinit garantiert thread-sichere Bereinigung. Mit DAI=MainActor wird es essentiell, Data Races zu vermeiden.
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves detection of unsafe access in deinit • DAI (Default Actor Isolation) : - nonisolated → isolated deinit optional - MainActor → isolated deinit almost mandatory 🔒 isolated deinit guarantees thread-safe cleanup. With DAI=MainActor, becomes essential to avoid data races.
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora detección de acceso inseguro en deinit • DAI (Default Actor Isolation) : - nonisolated → isolated deinit opcional - MainActor → isolated deinit casi obligatorio 🔒 isolated deinit garantiza limpieza thread-safe. Con DAI=MainActor, se vuelve esencial para evitar data races.
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : deinitでの安全でないアクセスの検出を改善 • DAI (Default Actor Isolation) : - nonisolated → isolated deinitはオプション - MainActor → isolated deinitはほぼ必須 🔒 isolated deinitはスレッドセーフなクリーンアップを保証します。 DAI=MainActorでは、データ競合を避けるために不可欠になります。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora detecção de acesso inseguro em deinit • DAI (Default Actor Isolation) : - nonisolated → isolated deinit opcional - MainActor → isolated deinit quase obrigatório 🔒 isolated deinit garante limpeza thread-safe. Com DAI=MainActor, torna-se essencial para evitar data races.
